{
    "scout": {
        "_desc": "Born and raised in Boston, Massachusetts, USA, the Scout is a fast-running scrapper with a baseball bat and snarky in-your-face attitude. He is the fastest and most mobile mercenary on the battlefield unassisted. Scout's Double Jump helps him outmaneuver slower opponents like the Heavy and navigate the terrain while dodging oncoming bullets and projectiles. Carrying a Scattergun, Pistol, and Bat, he is an ideal class for aggressive fighting and flanking. Scout excels at hit-and-run tactics that sap away enemy health as his high mobility allows him to get in, do damage, and escape before being noticed. However, Scout possesses the lowest default health pool (alongside the Engineer, Sniper, and Spy), leaving him vulnerable on the front line. However, this is a fair trade-off given his ability to run in and out of contested hot spots quickly, enabling him to turn the tide of battle before the enemy team can even take notice.",
        "_thumb": "https://wiki.teamfortress.com/wiki/File:Scout.png"
    },
    "soldier": {
        "_desc": "The Soldier is a crazed, jingoistic patriot from Midwest, USA, who portrays himself as a military man despite being rejected from the US army. Tough and well-armed, he is a versatile class, capable of both offense and defense, and a great starter class to get familiar with the game.",
        "_thumb": "https://wiki.teamfortress.com/wiki/File:Soldier.png"
    },
    "pyro": {
        "_desc": "The Pyro is a pyromaniac class of indeterminate origin with a muffled voice and a burning passion for all things fire related. As shown in Meet the Pyro, the Pyro may be delusional, visualizing themself in a utopian fantasy world known as Pyroland.",
        "_thumb": "https://wiki.teamfortress.com/wiki/File:Pyro.png"
    },
    "demoman": {
        "_desc": "The Demoman is a self-described black Scottish cyclops and a scrumpy-swilling demolitions expert from Ullapool, Scotland, who is one of the most versatile mercenaries. Capable of dealing large amounts of explosive damage, whether directly or through splash damage. Armed with his Grenade Launcher and Stickybomb Launcher, the Demoman uses his one good eye and knowledge of his surrounding environment for well-timed stickybomb detonations and precise grenade impacts that send enemies skyward, often in many pieces. His weapons' large splash radius can also work against him, if an enemy manages to catch him at close range he will often take damage from his own explosives as he struggles to defend himself.",
        "_thumb": "https://wiki.teamfortress.com/wiki/File:Demoman.png"
    },
    "heavy": {
        "_desc": "The Heavy Weapons Guy, more commonly known as the Heavy, is a towering hulk of a man hailing from the USSR. He is often considered the face of the game, due to his prominent appearance on box-art, promotional materials, and loading screens. He starred in the very first Meet the Team video, and has appeared in all further movies to date.",
        "_thumb": "https://wiki.teamfortress.com/wiki/File:Heavy.png"
    },
    "engineer": {
        "_desc": "The Engineer is a soft-spoken, amiable Texan from Bee Cave, Texas, USA with an interest in all mechanical things. He specializes in constructing and maintaining buildings that provide support to his team, rather than being a front line class, making him the most suitable for defense. The Engineer's various gadgets include the Sentry Gun, an automated turret that fires at any enemy in range, the Dispenser, a device that restores the health and ammunition of nearby teammates, and Teleporters that quickly transport players from point A to point B.",
        "_thumb": "https://wiki.teamfortress.com/wiki/File:Engineer.png"
    },
    "medic": {
        "_desc": "The Medic is a German man of questionable medical practices from Stuttgart, Germany. As the only class with a consistent healing source, he is often found near the front lines bolstering his teammates. Although the Medic's Syringe Gun and Bonesaw aren't the most excellent weapons for direct combat, he can typically still be found near the front lines, healing wounded teammates while trying to stay out of enemy fire.",
        "_thumb": "https://wiki.teamfortress.com/wiki/File:Medic.png"
    },   
    "sniper": {
        "_desc": "Hailing from the lost country of New Zealand and raised in the unforgiving outback of Australia, the Sniper is a tough and ready crack shot mercenary. The Sniper's main role on the battlefield is to pick off important enemy targets from afar using his Sniper Rifle and its ability to deal guaranteed Critical hits with a headshot (with some exceptions). He is effective at long range, but weakens with proximity, where he is forced to use his Submachine Gun or his Kukri. As a result, the Sniper tends to perch on higher grounds or in hard-to-see places, where he can easily pin down enemies at chokepoints.",
        "_thumb": "https://wiki.teamfortress.com/wiki/File:Sniper.png"
    },
    "spy": {
        "_desc": "Hailing from an indeterminate region of France, the Spy is a class known for his enthusiasm of sharp suits and even sharper knives. Using a unique array of cloaking watches, he can render himself invisible or even feign his own death, letting him infiltrate enemy lines with little chance of detection. His Disguise Kit lets him impersonate any class on either team. With enough skill in the art of deception, the Spy can momentarily fool enemies with his disguise, lulling them into a false sense of security. When the time is right, he can emerge from the woodwork to strike a killing blow, stabbing his unsuspecting \"teammate\" in the back. A backstab with any of the Spy's knives will kill most foes in a single hit — provided they are not under the effects of any type of invulnerability.",
        "_thumb": "https://wiki.teamfortress.com/wiki/File:Spy.png"
    }
}